# AdvancedOpaque Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedOpaque Class
Members See Also
---
A static class that provides access to the property names that appear in the AdvancedOpaque visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class AdvancedOpaque
```

Visual Basic
---
```text
Public NotInheritable Class AdvancedOpaque
```

Visual C++
---
```text
public ref class AdvancedOpaque abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AdvancedOpaque
# See Also
AdvancedOpaque Members
Autodesk.Revit.DB.Visual Namespace